Tekla.Structures.Model.RebarEndDetailModifier.EndTypeEnum
The end type.

Tekla.Structures.Model.RebarEndDetailModifier.EndTypeEnum.HOOK
Hook.

Tekla.Structures.Model.RebarEndDetailModifier.EndTypeEnum.CRANKING
Cranking.